namespace :sms do
  namespace :db do
    task :fill => [:empty_all, :populate] 
  
    task :empty_all => :environment do
      ScheduleItem.destroy_all
      TeacherSubject.destroy_all
      Subject.destroy_all  
      StudentGroup.destroy_all  
      ClassRoom.destroy_all  
      Person.destroy_all  
      Role.destroy_all
      AclAction.destroy_all
    end
    
    task :populate do
      create_settings
      acl_actions = create_acl_actions
      roles = create_roles
      assign_acl_actions
      groups = create_groups
      students = create_students(groups)
      class_rooms, room_map = create_rooms_and_map
      subject_ids = create_subject_ids(room_map)
      teachers = create_teachers
      create_teacher_subjects(teachers)
      admin = User.create :login => "qwe", :password => "123qwe", :password_confirmation => "123qwe", :email => "qwe@asdasd.ru", :first_name => "first", :last_name => "last", :birth_date => DateTime.now, :home_address => "qwe", :role_id => Role.admin.id, :patronymic => "patronymic", :sex => "male"
      admin.save
    end
    
    task :fill_acl_actions => :environment do
      AclAction.destroy_all
      create_acl_actions
      assign_acl_actions
    end
    
    def create_settings
      Settings["short_break"] = 10
      Settings["long_break"] = 20
      Settings["lessons_start"] = Time.utc(2010,02,02,8,0,0)
      Settings["lesson_length"] = 45
    end
    
    def create_acl_actions
      AclAction.create ACL_ACTIONS
    end
    
    def create_roles
      ROLES.each do |role|
        Role.create :name => role
      end
    end
    
    def create_groups
      groups = []
      Subject::SCHOOL_YEARS.each do |year|
        LETTERS.each do |letter|
          group = StudentGroup.create :year => year, :letter => letter
          groups << group
        end
      end
      groups
    end
    
    def create_students(groups)
      students = []
      Student.transaction do 
        STUDENTS.each_with_index do |student_name, index|
          student = Student.create :birth_date => DateTime.now, :email => "student#{index}@asdasd.ru", 
            :first_name => student_name.second.split.first, :last_name => student_name.first,
            :patronymic => student_name.second.split.second, :sex => student_name[2], :student_group_id => groups[index % groups.size].id
          students << student
        end
      end
      students
    end
    
    def assign_acl_actions
      Role.admin.acl_actions << AclAction.find_by_name("users")
      Role.admin.acl_actions << AclAction.find_by_name("roles")
    end
    
    def create_rooms_and_map
      class_rooms = []
      room_map = {}
      for i in 1..FLOOR_COUNT do
        for j in 1..ROOMS_PER_FLOOR do
          class_room = ClassRoom.create :number => (i.to_s + (j < 10 ? "0" : "") + j.to_s)
          class_rooms << class_room
          room_map[class_room.number.to_sym] = class_room
        end
      end
      return class_rooms, room_map
    end
    
    def create_subject_ids(room_map)
      subject_ids = []
      Subject::SCHOOL_YEARS.each do |year|
        subject_no = 0
        subjects = []
        SUBJECT_NAMES.each do |subject_name|
          subjects << Subject.new(:name => subject_name, :year => year, :hours_per_week => 4)
        end
        for i in 1..FLOOR_COUNT do
          for j in 1..ROOMS_PER_FLOOR do
            room_no = i.to_s + (j < 10 ? "0" : "") + j.to_s
            subjects[subject_no].class_rooms << room_map[room_no.to_sym]
            subject_no += 1
            if subject_no >= SUBJECT_NAMES.length
              subject_no = 0
            end
          end
        end
        subjects.each do |subject|
          subject.save
          subject_ids << subject.id
        end
      end
      subject_ids
    end
    
    def create_teachers
      teachers = []
      TEACHERS.each_with_index do |teacher_name, index|
        teacher = Teacher.create :birth_date => DateTime.now, :email => "teacher#{index}@asdasd.ru", 
          :first_name => teacher_name.second.split.first, :last_name => teacher_name.first,
          :patronymic => teacher_name.second.split.second, :login => "teacher#{index}", 
          :password => "password", :password_confirmation => "password", :role_id => Role.teacher.id,
          :sex => teacher_name[2]          
        teachers << teacher
      end
      teachers
    end
    
    def create_teacher_subjects(teachers)
      j = 0
      Subject::SCHOOL_YEARS.each do |year|
        year_groups = StudentGroup.by_year(year)
        year_subjects = Subject.by_year(year)
        year_groups.each do |group|
          year_subjects.each do |subject|
            teacher = teachers[j]
            TeacherSubject.create :student_group => group, :teacher => teacher, :subject => subject
            j += 1
            if j >= teachers.length
              j = 0
            end
          end
        end
      end
    end
    
    ACL_ACTIONS = [
      { :name => "users", :title => "Пользователи" },
      { :name => "roles", :title => "Роли" },
      { :name => "news/new", :title => "Управление новостями" },
      { :name => "years", :title => "Учебные годы и четверти" },
      { :name => "time_table_items", :title => "Расписание звонков" },
      { :name => "class_rooms", :title => "Аудитории" },
      { :name => "students", :title => "Ученики" },
      { :name => "student_groups", :title => "Классы" },
      { :name => "subjects", :title => "Предметы" },
      { :name => "teacher_subjects", :title => "Предметы учителей" },
      { :name => "schedule", :title => "Расписание занятий" },
      { :name => "register", :title => "Журналы" },
      { :name => "comments", :title => "Управление комментариями" }
    ]
    
    LETTERS = ["A", "B", "C"]
    SUBJECT_NAMES = ["Математика", "Русский язык", "Белорусский язык", 
            "Физкультура", "Физика", "Химия", 
            "История", "Английский язык", "Биология"]
    FLOOR_COUNT = 3
    ROOMS_PER_FLOOR = 15
    ROLES = [
      "Администратор",
      "Учитель",
      "Родитель",
      "Методист",
      "Директор"
    ]
    
    TEACHERS = [
      ["Абрамишвили", "Мария Гурамовна", "female"],
      ["Августинович", "Глория Олеговна", "female"],
      ["Авеева", "Ева Владимировна", "female"],
      ["Аверина", "Ирина Егоровна", "female"],
      ["Агапова", "Нина Фёдоровна", "female"],
      ["Агуреева", "Полина Владимировна", "female"],
      ["Адельгейм", "Тамара Фридриховна", "female"],
      ["Азарова", "Анна Александровна", "female"],
      ["Азарх-Опалова", "Евгения Эммануиловна", "female"],
      ["Акимова", "Софья Павловна", "female"],
      ["Акиньшина", "Оксана Александровна", "female"],
      ["Аксюта", "Татьяна Владимировна", "female"],
      ["Акулова", "Ирина Григорьевна", "female"],
      ["Акулова", "Тамара Васильевна", "female"],
      ["Алабина", "Инна Ильинична", "female"],
      ["Александрова", "Марина Андреевна", "female"],
      ["Алексахина", "Анна Яковлевна", "female"],
      ["Алентова", "Вера Валентиновна", "female"],
      ["Алимова", "Матлюба Фархатовна", "female"],
      ["Алфёрова", "Ирина Ивановна", "female"],
      ["Вдовина", "Наталья Геннадьевна", "female"],
      ["Вележева", "Лидия Леонидовна", "female"],
      ["Великанова", "Елена Сергеевна", "female"],
      ["Волчек", "Галина Борисовна", "female"],
      ["Вертинская", "Анастасия Александровна", "female"],
      ["Вертинская", "Марианна Александровна", "female"],
      ["Вилкова", "Екатерина Николаевна", "female"],
      ["Вилкова", "Таисия Александровна", "female"],
      ["Виноградова", "Мария Сергеевна", "female"],
      ["Вознесенская", "Анастасия Валентиновна", "female"],
      ["Воилкова", "Валентина Дмитриевна", "female"],
      ["Волкова", "Екатерина Юрьевна", "female"],
      ["Волкова", "Ольга Владимировна", "female"],
      ["Дамскер", "Юлия Иосифовна", "female"],
      ["Данилина", "Эльвира Игоревна", "female"],
      ["Данилова", "Наталья Юрьевна", "female"],
      ["Дапкунайте", "Ингеборга Эдмундовна", "female"],
      ["Дворжецкая", "Нина Игоревна", "female"],
      ["Дезмари", "Диана Игоревна", "female"],
      ["Демидова", "Алла Сергеевна", "female"],
      ["Державина", "Наталья Владимировна", "female"],
      ["Джербинова", "Юлия Георгиевна", "female"],
      ["Джураева", "Тамара Николаевна", "female"],
      ["Димова", "Анна Олеговна", "female"],
      ["Дитковските", "Агния Олеговна", "female"],
      ["Добровольская", "Евгения Владимировна", "female"],
      ["Догилева", "Татьяна Анатольевна", "female"],
      ["Дольникова", "Теона Валентиновна", "female"],
      ["Доронина", "Татьяна Васильевна", "female"],
      ["Дорохина", "Александра Митрофановна", "female"],
      ["Дорохина", "Оксана Сергеевна", "female"],
      ["Юганова", "Алла Сергеевна", "female"],
      ["Юдина", "Зоя Борисовна", "female"],
      ["Юдина", "Ирина Юрьевна", "female"],
      ["Юнгер", "Елена Владимировна", "female"],
      ["Юнникова", "Наталья Александровна", "female"],
      ["Соколова", "Галина Михайловна", "female"],
      ["Соколова", "Зинаида Сергеевна", "female"],
      ["Соколова", "Ирина Леонидовна", "female"],
      ["Соколова", "Любовь Сергеевна", "female"],
      ["Солдатова", "Наталья Эдуардовна", "female"],
      ["Соловей", "Елена Яковлевна", "female"],
      ["Соломина", "Варвара Михайловна", "female"],
      ["Соломина", "Екатерина Сергеевна", "female"],
      ["Сотникова", "Вера Михайловна", "female"],
      ["Сотничевская", "Софья Владимировна", "female"],
      ["Спивак", "Эмилия Семёновна", "female"],
      ["Столповская", "Ольга Борисовна", "female"],
      ["Стрелкова-Оболдина", "Инга Петровна", "female"],
      ["Стрельская", "Варвара Васильевна", "female"],
      ["Стрепетова", "Полина Антипьевна", "female"],
      ["Стриженова", "Екатерина Владимировна", "female"],
      ["Стриженова", "Любовь Васильевна", "female"],
      ["Стриженова", "Марианна Александровна", "female"],
      ["Судейкина", "Вера Артуровна", "female"],
      ["Судзиловская", "Олеся Ильинична", "female"],
      ["Сутулова", "Ольга Александровна", "female"],
      ["Сухаревская", "Лидия Петровна", "female"],
      ["Суюншалина", "Бибигуль Актановна", "female"],
      ["Сёмина", "Тамара Петровна", "female"],
      ["Сёмкина", "Мария Рафаиловна", "female"]
    ]
    
    STUDENTS = [ 
      ["Агнивцев", "Николай Яковлевич", "male"],
      ["Адамович", "Георгий Викторович", "male"],
      ["Алексеев", "Геннадий Иванович", "male"],
      ["Анненский", "Иннокентий Фёдорович", "male"],
      ["Аронзон", "Леонид Львович", "male"],
      ["Ахматова", "Анна Андреевна", "female"],
      ["Барскова", "Полина Юрьевна", "female"],
      ["Бахтерев", "Игорь Владимирович", "male"],
      ["Берггольц", "Ольга Фёдоровна", "female"],
      ["Березовчук", "Лариса Николаевна", "female"],
      ["Бетаки", "Василий Павлович", "male"],
      ["Блок", "Александр Александрович", "male"],
      ["Бобышев", "Дмитрий Васильевич", "male"],
      ["Ботвинник", "Семён Вульфович", "male"],
      ["Британишский", "Владимир Львович", "male"],
      ["Бродский", "Иосиф Александрович", "male"],
      ["Буковская", "Тамара Симоновна", "female"],
      ["Булатовский", "Игорь Валерьевич", "male"],
      ["Виноградов", "Леонид Аркадьевич", "male"],
      ["Волохонский", "Анри Гиршевич", "male"],
      ["Вольтская", "Татьяна Анатольевна", "female"],
      ["Вольф", "Сергей Евгеньевич", "male"],
      ["Гаген-Торн", "Нина Ивановна", "female"],
      ["Гампер", "Галина Сергеевна", "female"],
      ["Гандельсман", "Владимир Аркадьевич", "male"],
      ["Генделев", "Михаил Самуэлевич", "male"],
      ["Гиппиус", "Владимир Васильевич", "male"],
      ["Гиппиус", "Зинаида Николаевна", "female"],
      ["Гитович", "Александр Ильич", "male"],
      ["Горбовский", "Глеб Яковлевич", "male"],
      ["Горнон", "Александр Георгиевич", "male"],
      ["Гофман", "Виктор Викторович", "male"],
      ["Григорьев", "Дмитрий Анатольевич", "male"],
      ["Грудинина", "Наталья Иосифовна", "female"],
      ["Гумилёв", "Николай Степанович", "male"],
      ["Гуро", "Елена", "female"],
      ["Драгомощенко", "Аркадий Трофимович", "male"],
      ["Друскин", "Лев Савельевич", "male"],
      ["Дудин", "Михаил Александрович", "male"],
      ["Егунов", "Андрей Николаевич", "male"],
      ["Ерёмин", "Михаил Фёдорович", "male"],
      ["Завьялов", "Сергей Александрович", "male"],
      ["Зельченко", "Всеволод Владимирович", "male"],
      ["Иванова", "Светлана Алексеевна", "female"],
      ["Игнатова", "Елена Алексеевна", "female"],
      ["Каменский", "Василий Васильевич", "male"],
      ["Колкер", "Юрий Иосифович", "male"],
      ["Комаровский", "Василий Алексеевич", "male"],
      ["Кондратов", "Александр Михайлович", "male"],
      ["Кононов", "Николай Михайлович", "male"],
      ["Кривулин", "Виктор Борисович", "male"],
      ["Кудряшева", "Алина Кирилловна", "female"],
      ["Кузмин", "Михаил Алексеевич", "male"],
      ["Кузьминский", "Константин Константинович", "male"],
      ["Кулле", "Сергей Леонидович", "male"],
      ["Кульман", "Елисавета Борисовна", "female"],
      ["Куляхтин", "Александр", "male"],
      ["Кучерявкин", "Владимир Иванович", "male"],
      ["Кушнер", "Александр Семёнович", "male"],
      ["Лебедев-Кумач", "Василий Иванович", "male"],
      ["Лейкин", "Вячеслав Абрамович", "male"],
      ["Лившиц", "Бенедикт Константинович", "male"],
      ["Магид", "Сергей Яковлевич", "male"],
      ["Максимов", "Дмитрий Евгеньевич", "male"],
      ["Мандельштам", "Роальд Чарльзович", "male"],
      ["Машевский", "Алексей Геннадьевич", "male"],
      ["Мережковский", "Дмитрий Сергеевич", "male"],
      ["Мирзаев", "Арсен Магомедович", "male"],
      ["Миронов", "Александр Николаевич", "male"],
      ["Мишин", "Валерий Андреевич", "male"],
      ["Найман", "Анатолий Генрихович", "male"],
      ["Недоброво", "Николай Владимирович", "male"],
      ["Ожиганов", "Александр Фёдорович", "male"],
      ["Окунь", "Михаил Евсеевич", "male"],
      ["Охапкин", "Олег Александрович", "male"],
      ["Парнок", "София Яковлевна", "female"],
      ["Петров", "Сергей Владимирович", "male"],
      ["Полонская", "Елизавета Григорьевна", "female"],
      ["Потёмкин", "Пётр Петрович", "male"],
      ["Прокофьев", "Александр Андреевич", "male"],
      ["Пурин", "Алексей Арнольдович", "male"],
      ["Пушкин", "Александр Сергеевич", "male"],
      ["Попов", "Валентин Леонидович", "male"],
      ["Радлова", "Анна Дмитриевна", "female"],
      ["Рейн", "Евгений Борисович", "male"],
      ["Ривин", "Александр Иосифович", "male"],
      ["Рождественский", "Всеволод Александрович", "male"],
      ["Свиридова", "София Александровна", "female"],
      ["Семёнов", "Глеб Сергеевич", "male"],
      ["Слепакова", "Нонна Менделевна", "female"],
      ["Сологуб", "Фёдор Кузьмич", "male"],
      ["Соснора", "Виктор Александрович", "male"],
      ["Стратановский", "Сергей Георгиевич", "male"],
      ["Тимофеев-Еропкин", "Борис Николаевич", "male"],
      ["Унксова", "Кари Васильевна", "female"],
      ["Уфлянд", "Владимир Иосифович", "male"],
      ["Филиппов", "Василий Анатольевич", "male"],
      ["Фоняков", "Илья Олегович", "male"],
      ["Хармс", "Даниил Иванович", "male"],
      ["Хвостенко", "Алексей Львович", "male"],
      ["Шварц", "Елена Андреевна", "female"],
      ["Шельвах", "Алексей Максимович", "male"],
      ["Шефнер", "Вадим Сергеевич", "male"],
      ["Шнейдерман", "Ася Эдуардовна", "female"],
      ["Шубинский", "Валерий Игоревич", "male"],
      ["Эрль", "Владимир Ибрагимович", "male"],
      ["Якимчук", "Николай Алексеевич", "male"],
      ["Яснов", "Михаил Давидович", "male"],
      
      ["Абдусаламов", "Шавкат Фазилович", "male"],
      ["Аввакумов", "Михаил Николаевич", "male"],
      ["Аввакумов", "Николай Михайлович", "male"],
      ["Аветов", "Михаил Никитич", "male"],
      ["Адливанкин", "Самуил Яковлевич", "male"],
      ["Азарх", "Лана Александровна", "female"],
      ["Азизян", "Ирина Атыковна", "female"],
      ["Айзенберг", "Нина Евсеевна", "female"],
      ["Алексеев", "Георгий Дмитриевич", "male"],
      ["Алфёров", "Александр Порфирьевич", "male"],
      ["Альберти", "Петр Филиппович", "male"],
      ["Андронов", "Николай Иванович", "male"],
      ["Анпилов", "Андрей Дмитриевич", "male"],
      ["Анреп", "Борис Васильевич", "male"],
      ["Антипова", "Евгения Петровна", "female"],
      ["Антокольский", "Лейба Мовшевич", "male"],
      ["Апсит", "Александр Петрович", "male"],
      ["Арапов", "Анатолий Афанасьевич", "male"],
      ["Аронов", "Лев Ильич", "male"],
      ["Артемьев", "Сергей Васильевич", "male"],
      ["Афонина", "Таисия Кирилловна", "female"],
      ["Бабаева", "Надежда Акимовна", "female"],
      ["Баганц", "Фёдор Фёдорович", "male"],
      ["Баженов", "Всеволод Андреевич", "male"],
      ["Байкова", "Евгения Васильевна", "female"],
      ["Балдина", "Ирина Михайловна", "female"],
      ["Баринова", "Галина Сергеевна", "female"],
      ["Бартенев", "Лев Николаевич", "male"],
      ["Баскаков", "Николай Николаевич", "male"],
      ["Батюков", "Исаак Полиевктович", "male"],
      ["Бачурин", "Евгений Владимирович", "male"],
      ["Бедина", "Алла Игоревна", "female"],
      ["Белан", "Василий Никитич", "male"],
      ["Белов", "Владимир Никитич", "male"],
      ["Белов", "Кондратий Петрович", "male"],
      ["Белов", "Пётр Алексеевич", "male"],
      ["Белов", "Станислав Кондратьевич", "male"],
      ["Белов", "Юрий Владимирович", "male"],
      ["Белова", "Ангелина Петровна", "female"],
      ["Белоусов", "Пётр Петрович", "male"],
      ["Бенуа", "Альберт Николаевич", "male"],
      ["Бершадский", "Юлий Рафаилович", "male"],
      ["Бестужев", "Николай Александрович", "male"],
      ["Бехтеев", "Владимир Георгиевич", "male"],
      ["Бибишев", "Вячеслав Леонардович", "male"],
      ["Биленкий", "Исаак Моисеевич", "male"],
      ["Биргер", "Борис Григорьевич", "male"],
      ["Блонская", "Серафима Иасоновна", "female"],
      ["Богатырёв", "Михаил Григорьевич", "male"],
      ["Богданов-Бельский", "Николай Петрович", "male"],
      ["Богомолец", "Лев Константинович", "male"],
      ["Бойм", "Александр Соломонович", "male"],
      ["Борисов", "Вениамин Иванович", "male"],
      ["Борисов", "Пётр Иванович", "male"],
      ["Боровский", "Давид Борисович", "male"],
      ["Бородаевский", "Сергей Осипович", "male"],
      ["Босенко", "Владимир Андреевич", "male"],
      ["Бочаров", "Михаил Ильич", "male"],
      ["Бразер", "Абрам Маркович", "male"],
      ["Британишский", "Лев Романович", "male"],
      ["Бритов", "Ким Николаевич", "male"],
      ["Бродский", "Исаак Израилевич", "male"],
      ["Бронников", "Фёдор Андреевич", "male"],
      ["Брюханов", "Николай Михайлович", "male"],
      ["Бузовкин", "Александр Андреевич", "male"],
      ["Букова", "Татьяна Сергеевна", "female"],
      ["Бурьян", "Олег Юрьевич", "male"],
      ["Бучкин", "Пётр Дмитриевич", "male"],
      ["Бызова", "Злата Николаевна", "female"],
      ["Васильев", "Анатолий Леонидович", "male"],
      ["Васми", "Рихард Рудольфович", "male"],
      ["Васнецов", "Андрей Владимирович", "male"],
      ["Ваулин", "Пётр Кузьмич", "male"],
      ["Вебер", "Яков Яковлевич", "male"],
      ["Вейгельт", "Роберт Карлович", "male"],
      ["Видгоф", "Давид Осипович", "male"],
      ["Вишняк", "Мария Владимировна", "female"],
      ["Войшвилло", "Евгений Валерианович", "male"],
      ["Волков", "Андрей Викторович", "male"],
      ["Волков", "Василий Романович", "male"],
      ["Волкова", "Ольга Александровна", "female"],
      ["Волович", "Виталий Михайлович", "male"],
      ["Воронцов", "Дмитрий Андреевич", "male"],
      ["Гадаев", "Лазарь Тазеевич", "male"],
      ["Галахов", "Владимир Васильевич", "male"],
      ["Галкин", "Илья Савич", "male"],
      ["Ганзен", "Алексей Васильевич", "male"],
      ["Гаричев", "Анатолий Евлампиевич", "male"],
      ["Герасимов", "Сергей Васильевич", "male"],
      ["Гогуадзе", "Альберт Иосифович", "male"],
      ["Голиков", "Василий Васильевич", "male"],
      ["Голиков", "Иван Иванович", "male"],
      ["Головачевский", "Кирилл Иванович", "male"],
      ["Горбатов", "Константин Иванович", "male"],
      ["Горбунов", "Кирилл Антонович", "male"],
      ["Горелик", "Марк Борисович", "male"],
      ["Горелов", "Гавриил Никитич", "male"],
      ["Горин", "Иван Петрович", "male"],
      ["Горохов", "Иван Лаврентьевич", "male"],
      ["Горохова", "Ольга Юрьевна", "female"],
      ["Григорьев", "Олег Евгеньевич", "male"],
      ["Григорян", "Владимир Гамлетович", "male"],
      ["Гринман", "Илья Абрамович", "male"],
      ["Громме", "Василий Тильманович", "male"],
      ["Громов", "Алексей Матвеевич", "male"],
      ["Громов", "Валентин Владимирович", "male"],
      ["Гуркин", "Григорий Иванович", "male"],
      ["Гурьянов", "Василий Павлович", "male"],
      ["Гусев", "Борис Петрович", "male"],
      ["Гущин", "Николай Михайлович", "male"],
      ["Давыдов", "Борис Иванович", "male"],
      ["Денисов", "Василий Иванович", "male"],
      ["Джикия", "Александр Ролланович", "male"],
      ["Дмитриев", "Олег Алексеевич", "male"],
      ["Дмитриев-Оренбургский", "Николай Дмитриевич", "male"],
      ["Дубовской", "Николай Никанорович", "male"],
      ["Дурнов", "Модест Александрович", "male"],
      ["Елгаштина", "Мария Николаевна", "female"],
      ["Ельяшевич", "Сима Саадьевич", "male"],
      ["Еркимбаев", "Рауль Альбертович", "male"],
      ["Ермаков", "Иван Дмитриевич", "male"],
      ["Ермилов", "Василий Дмитриевич", "male"],
      ["Ермолаева", "Вера Михайловна", "female"],
      ["Жабинский", "Александр Михайлович", "male"],
      ["Заполянский", "Гавриил Аронович", "male"],
      ["Зинатулина", "Лилия Геннадьевна", "female"],
      ["Зотикова", "Любовь Алексеевна", "female"],
      ["Иванов-Голубой", "Антон Иванович", "male"],
      ["Кандауров", "Отари Захарович", "male"],
      ["Каневский", "Аминадав Моисеевич", "male"],
      ["Канеев", "Михаил Александрович", "male"],
      ["Кантор", "Максим Карлович", "male"],
      ["Канторович", "Лев Владимирович", "male"],
      ["Каратанов", "Дмитрий Иннокентьевич", "male"],
      ["Кардовский", "Дмитрий Николаевич", "male"],
      ["Касаткин", "Николай Алексеевич", "male"],
      ["Келин", "Пётр Иванович", "male"],
      ["Кириллов", "Сергей Алексеевич", "male"],
      ["Кирнарский", "Марк Абрамович", "male"],
      ["Китаева", "Елена Николаевна", "female"],
      ["Ковригин", "Егор Ильич", "male"],
      ["Козелл", "Михаил Георгиевич", "male"],
      ["Козлов", "Энгельс Васильевич", "male"],
      ["Козловская", "Марина Андреевна", "female"],
      ["Козьмина", "Лидия Александровна", "female"],
      ["Колкутин", "Андрей Борисович", "male"],
      ["Колокольников", "Иван Лукич", "male"],
      ["Кольцов", "Сергей Васильевич", "male"],
      ["Кольцова-Бычкова", "Александра Григорьевна", "female"],
      ["Конышева", "Натта Ивановна", "female"],
      ["Конюхов", "Фёдор Филиппович", "male"],
      ["Копелян", "Исаак Залманович", "male"],
      ["Копнина", "Татьяна Владимировна", "female"],
      ["Копытцева", "Майя Кузьминична", "female"],
      ["Корбаков", "Владимир Николаевич", "male"],
      ["Корнеев", "Борис Васильевич", "male"],
      ["Коробицын", "Александр Иванович", "male"],
      ["Коровин", "Константин Алексеевич", "male"],
      ["Коровяков", "Александр Петрович", "male"],
      ["Костенко", "Елена Михайловна", "female"],
      ["Костенко", "Константин Евтихович", "male"],
      ["Костров", "Николай Иванович", "male"],
      ["Котов", "Пётр Иванович", "male"],
      ["Котьянц", "Геворк Вартанович", "male"],
      ["Кравцов", "Евгений Михайлович", "male"],
      ["Кранц", "Владимир Павлович", "male"],
      ["Краснов", "Борис Аркадьевич", "male"],
      ["Крестовский", "Ярослав Игоревич", "male"],
      ["Кропивницкий", "Лев Евгеньевич", "male"],
      ["Кругликова", "Елизавета Сергеевна", "female"],
      ["Крылов", "Никифор Степанович", "male"],
      ["Крымов", "Николай Петрович", "male"],
      ["Кузьмин", "Аркадий Алексеевич", "male"],
      ["Кукуйцев", "Валентин Васильевич", "male"],
      ["Куликов", "Иван Семёнович", "male"],
      ["Кульченко", "Валерий Иванович", "male"],
      ["Куранская", "Ольга Степановна", "female"],
      ["Курдов", "Владимир Георгиевич", "male"],
      ["Курилко", "Михаил Иванович", "male"],
      ["Курилко-Рюмин", "Михаил Михайлович", "male"],
      ["Кустодиев", "Борис Михайлович", "male"],
      ["Лабас", "Александр Аркадьевич", "male"],
      ["Лавров", "Николай Андреевич", "male"],
      ["Лактионов", "Александр Иванович", "male"],
      ["Ланской", "Андрей Михайлович", "male"],
      ["Лапин", "Иван Фёдорович", "male"],
      ["Левин", "Семён Михайлович", "male"],
      ["Ледантю", "Михаил Васильевич", "male"],
      ["Леднев", "Валерий Александрович", "male"],
      ["Леднев-Щукин", "Сергей Евграфович", "male"],
      ["Лейдерман", "Юрий Александрович", "male"],
      ["Либеров", "Алексей Николаевич", "male"],
      ["Лоскутов", "Артём Александрович", "male"],
      ["Лукьянов", "Владимир Сергеевич", "male"],
      ["Лучишкин", "Сергей Алексеевич", "male"],
      ["Лысенко", "Андрей Гаврилович", "male"],
      ["Любимов", "Александр Михайлович", "male"],
      ["Магарил", "Евгения Марковна", "female"],
      ["Магдесян", "Эммануил Яковлевич", "male"],
      ["Маевский", "Дмитрий Иванович", "male"],
      ["Макаревич", "Андрей Вадимович", "male"],
      ["Маланчук", "Юлия Николаевна", "female"],
      ["Малявин", "Филипп Андреевич", "male"],
      ["Мамонов", "Владислав Васильевич", "male"],
      ["Мамонтов", "Николай Андреевич", "male"],
      ["Маневич-Каплан", "Белла Семёновна", "female"],
      ["Маслаев", "Александр Витальевич", "male"],
      ["Матюшин", "Михаил Владимирович", "male"],
      ["Медведев", "Пётр Иванович", "male"],
      ["Мешков", "Василий Васильевич", "male"],
      ["Мильман", "Адольф Израилевич", "male"],
      ["Митурич", "Пётр Васильевич", "male"],
      ["Моллер", "Фёдор Антонович", "male"],
      ["Морозов", "Федор Михайлович", "male"],
      ["Мурванидзе", "Теймураз Давидович", "male"],
      ["Мушаилов", "Мушаил Ханухович", "male"],
      ["Мясников", "Геннадий Алексеевич", "male"],
      ["Намдаков", "Даши Бальжанович", "male"],
      ["Немухин", "Александр Николаевич", "male"],
      ["Немченок", "Ася Викторовна", "female"],
      ["Ненаживин", "Валерий Геннадьевич", "male"],
      ["Ненаживина", "Ирина Валерьевна", "female"],
      ["Ненаживина", "Ольга Валерьевна", "female"],
      ["Непахарев", "Юрий Васильевич", "male"],
      ["Нестерова", "Наталья Игоревна", "female"],
      ["Нефф", "Тимофей Андреевич", "male"],
      ["Никитин", "Роман Никитич", "male"],
      ["Никонов", "Павел Фёдорович", "male"],
      ["Никонова", "Виктория Павловна", "female"],
      ["Нисский", "Георгий Григорьевич", "male"],
      ["Норштейн", "Юрий Борисович", "male"],
      ["Носырев", "Леонид Викторович", "male"],
      ["Нюренберг", "Амшей Маркович", "male"],
      ["Овчинников", "Владимир Иванович", "male"],
      ["Оньков", "Виталий Николаевич", "male"],
      ["Орлов", "Дмитрий Стахиевич", "male"],
      ["Осипов", "Сергей Иванович", "male"],
      ["Пальмов", "Виктор Никандрович", "male"],
      ["Панов", "Эдуард Парфирьевич", "male"],
      ["Парнах", "Максим Александрович", "male"],
      ["Пастернак", "Леонид Осипович", "male"],
      ["Перевышко", "Анатолий Иванович", "male"],
      ["Песков", "Михаил Иванович", "male"],
      ["Пименов", "Валерий Васильевич", "male"],
      ["Писахов", "Степан Григорьевич", "male"],
      ["Плутенко", "Станислав Владимирович", "male"],
      ["Плюшар", "Евгений Александрович", "male"],
      ["Погарский", "Михаил Валентинович", "male"],
      ["Погодин", "Виктор Александрович", "male"],
      ["Погонкин", "Владимир Иванович", "male"],
      ["Подскочин", "Олег Валентинович", "male"],
      ["Позднеев", "Николай Матвеевич", "male"],
      ["Поклад", "Николай Станиславович", "male"],
      ["Поливанова", "Юлия Валентиновна", "female"],
      ["Поляков", "Виктор Иванович", "male"],
      ["Потапов", "Сергей Владимирович", "male"],
      ["Приселков", "Сергей Васильевич", "male"],
      ["Пронских", "Фёдор Ефимович", "male"],
      ["Прохоров", "Константин Александрович", "male"],
      ["Прохоров", "Семён Маркович", "male"],
      ["Прядихин", "Александр Тимофеевич", "male"],
      ["Пустовойтов", "Семён Иванович", "male"],
      ["Пчелин", "Валерий Павлович", "male"],
      ["Пьянов", "Валерий Александрович", "male"],
      ["Пясецкий", "Павел Яковлевич", "male"],
      ["Рабинович", "Любовь Семёновна", "female"],
      ["Рейхет", "Виктор Иосифович", "male"],
      ["Репко", "Михаил Алексеевич", "male"],
      ["Реутова", "Маргарита Викторовна", "female"],
      ["Родионов", "Михаил Семёнович", "male"],
      ["Рожков", "Юрий Николаевич", "male"],
      ["Ройтер", "Михаил Григорьевич", "male"],
      ["Ромадин", "Михаил Николаевич", "male"],
      ["Романович", "Сергей Михайлович", "male"],
      ["Ромашин", "Алексей Валерьевич", "male"],
      ["Ротанов", "Николай Михайлович", "male"],
      ["Русов", "Лев Александрович", "male"],
      ["Рушев", "Николай Константинович", "male"],
      ["Савенко", "Иван Григорьевич", "male"],
      ["Савенков", "Виктор Яковлевич", "male"],
      ["Савинов", "Глеб Александрович", "male"],
      ["Савинский", "Василий Евмениевич", "male"],
      ["Саксон", "Владимир Станиславович", "male"],
      ["Сальников", "Владимир Александрович", "male"],
      ["Сапожников", "Сергей Анатольевич", "male"],
      ["Сапунов", "Николай Николаевич", "male"],
      ["Сафронов", "Никас Степанович", "male"],
      ["Сашнева", "Александра Ивановна", "female"],
      ["Сведомский", "Александр Александрович", "male"],
      ["Селезнев", "Владимир Иванович", "male"],
      ["Семенов", "Александр Михайлович", "male"],
      ["Семёнов", "Арсений Никифорович", "male"],
      ["Сендеров", "Ной Иосифович", "male"],
      ["Сергин", "Александр Андреевич", "male"],
      ["Серов", "Валентин Александрович", "male"],
      ["Симонян", "Тарон Цолакович", "male"],
      ["Скуинь", "Елена Петровна", "female"],
      ["Слободин", "Михаил Исаакович", "male"],
      ["Смирнова", "Галина Александровна", "female"],
      ["Сойфертис", "Леонид Владимирович", "male"],
      ["Соколов", "Александр Иванович", "male"],
      ["Соколов", "Анатолий Александрович", "male"],
      ["Соколова", "Ариадна Леонидовна", "female"],
      ["Соловей", "Юрий Анисимович", "male"],
      ["Соломин", "Николай Константинович", "male"],
      ["Соломин", "Николай Николаевич", "male"],
      ["Сорокин", "Евгений Алексеевич", "male"],
      ["Стацинский", "Виталий Казимирович", "male"],
      ["Столбов", "Александр Сергеевич", "male"],
      ["Суходольский", "Петр Александрович", "male"],
      ["Тадевосян", "Егише Мартиросович", "male"],
      ["Таёжный", "Пётр Иванович", "male"],
      ["Тимирёв", "Владимир Сергеевич", "male"],
      ["Тимков", "Николай Ефимович", "male"],
      ["Токарев", "Александр Вячеславович", "male"],
      ["Траугот", "Валерий Георгиевич", "male"],
      ["Третчиков", "Владимир Григорьевич", "male"],
      ["Третьяков", "Николай Яковлевич", "male"],
      ["Трофимов", "Викентий Павлович", "male"],
      ["Тупикина", "Елена Николаевна", "female"],
      ["Тырса", "Николай Андреевич", "male"],
      ["Тыртов", "Роман Петрович", "male"],
      ["Урманче", "Баки Идрисович", "male"],
      ["Успенский", "Борис Александрович", "male"],
      ["Уткин", "Пётр Саввич", "male"],
      ["Федоровский", "Фёдор Фёдорович", "male"],
      ["Фейгин", "Моисей Александрович", "male"],
      ["Филимонов", "Вадим Иванович", "male"],
      ["Френц", "Рудольф Рудольфович", "male"],
      ["Хамдамов", "Рустам Усманович", "male"],
      ["Харламов", "Алексей Алексеевич", "male"],
      ["Хвостенко-Хвостов", "Александр Вениаминович", "male"],
      ["Хегай", "Илья Николаевич", "male"],
      ["Хлебников", "Валерий Иванович", "male"],
      ["Хлебникова", "Вера Владимировна", "female"],
      ["Хрустов", "Владимир Павлович", "male"],
      ["Целебровский", "Пётр Иванович", "male"],
      ["Церетели", "Василий Ревазович", "male"],
      ["Цузмер", "Ревекка Моисеевна", "female"],
      ["Цымбал", "Анатолий Андреевич", "male"],
      ["Челищев", "Павел Фёдорович", "male"],
      ["Черемных", "Михаил Михайлович", "male"],
      ["Черенов", "Петр Николаевич", "male"],
      ["Черепанов", "Ростислав Фёдорович", "male"],
      ["Чермошенцев", "Анатолий Алексеевич", "male"],
      ["Чернихов", "Яков Георгиевич", "male"],
      ["Честняков", "Ефим Васильевич", "male"]
    ]
  end
end